CSI API ETABS v1
cAreaObj.SetOpening Method
 Designates an area object(s) as an opening.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOpening(
	string Name,
	bool IsOpening,
	eItemType ItemType = eItemType.Objects
)
Function SetOpening (
	Name As String,
	IsOpening As Boolean,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim IsOpening As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetOpening(Name,
	IsOpening, ItemType)
int SetOpening(
	String^ Name,
	bool IsOpening,
	eItemType ItemType = eItemType::Objects
)
abstract SetOpening :
        Name : string *
        IsOpening : bool *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing area object or group, depending on the value of the ItemType item.
IsOpening
Type: System.Boolean
 This item should be set to True if the specified area object(s) is to be an opening, otherwise it should be False.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the area object specified by the Name item.
 If this item is Group, the assignment is made to all area objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected area objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the opening is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'designate an area object as an opening
   ret = SapModel.AreaObj.SetOpening("3", True)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace